src/cf/InformationRegisters/уатВнешниеИдентификаторыВыгружаемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатВнешниеИдентификаторыВыгружаемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВнешнийИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаправкаГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОбъектовУниверсальногоФормата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатВидыОбъектовУниверсальногоФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОбъектовУниверсальногоФормата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Документ_АвансовыйОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ_ПередачаМатериаловВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ_ПередачаМатериаловВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ_ПеремещениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ_ПоступлениеТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ_ОтражениеЗарплатыВФинансовомУчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ_ВыработкаСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ_СписаниеЗапасов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ_ВозвратТоваровПоставщику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/уатОбменДанными/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьУдалениеОбъектаXDTO(КомпонентыОбмена, Ссылка, ТипСсылкиXDTO) Экспорт
	
	Если ТипСсылкиXDTO.Имя = "ДокументСсылка.ПередачаМатериаловВПроизводство" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ПередачаМатериаловВПроизводство;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.АвансовыйОтчет" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_АвансовыйОтчет;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ПередачаМатериаловВЭксплуатацию" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ПередачаМатериаловВЭксплуатацию;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ПеремещениеТоваров" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ПеремещениеТоваров;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ПоступлениеТоваровУслуг" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ПоступлениеТоваровУслуг;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ОтражениеЗарплатыВФинансовомУчете" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ОтражениеЗарплатыВФинансовомУчете;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ВыработкаСотрудников" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ВыработкаСотрудников;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.СписаниеЗапасов" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_СписаниеЗапасов;
	ИначеЕсли ТипСсылкиXDTO.Имя = "ДокументСсылка.ВозвратТоваровПоставщику" Тогда
		ВидОбъекта = Перечисления.уатВидыОбъектовУниверсальногоФормата.Документ_ВозвратТоваровПоставщику;
	Иначе
		ВидОбъекта = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВнешниеИдентификаторыВыгружаемыхОбъектов.ВнешнийИдентификатор КАК ВнешнийИдентификатор
	|ИЗ
	|	РегистрСведений.уатВнешниеИдентификаторыВыгружаемыхОбъектов КАК уатВнешниеИдентификаторыВыгружаемыхОбъектов
	|ГДЕ
	|	уатВнешниеИдентификаторыВыгружаемыхОбъектов.Объект = &Объект
	|	И уатВнешниеИдентификаторыВыгружаемыхОбъектов.ВидОбъекта = &ВидОбъекта");
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.УстановитьПараметр("ВидОбъекта", ВидОбъекта);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		УИДОбъектаXDTO = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныйИдентификаторПоСсылкеОбъекта(
			КомпонентыОбмена.УзелКорреспондента, Ссылка);
		ЗаписатьУдалениеОбъектаXDTOПоИдентификатору(КомпонентыОбмена, УИДОбъектаXDTO, ТипСсылкиXDTO);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			УИДОбъектаXDTO = СокрЛП(Выборка.ВнешнийИдентификатор);
			ЗаписатьУдалениеОбъектаXDTOПоИдентификатору(КомпонентыОбмена, УИДОбъектаXDTO, ТипСсылкиXDTO);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Копия процедуры ОбменДаннымиXDTOСервер.ЗаписатьУдалениеОбъектаXDTO,
// но вместо ссылки на объект используется его GUID
//
Процедура ЗаписатьУдалениеОбъектаXDTOПоИдентификатору(КомпонентыОбмена, УИДОбъектаXDTO, ТипСсылкиXDTO)
	
	Если Не ЗначениеЗаполнено(УИДОбъектаXDTO) Тогда
		Возврат;
	КонецЕсли;
	
	XMLСхема = КомпонентыОбмена.XMLСхема;
	ТипXDTO  = ФабрикаXDTO.Тип(XMLСхема, "УдалениеОбъекта");
	
	Для Каждого Свойство Из ТипXDTO.Свойства[0].Тип.Свойства[0].Тип.Свойства Цикл
		Если Свойство.Тип = ТипСсылкиXDTO Тогда
			
			ЗначениеXDTOЛюбаяСсылка = ФабрикаXDTO.Создать(Свойство.Тип, УИДОбъектаXDTO);
			
			СсылкаНаОбъект = ФабрикаXDTO.Создать(ТипXDTO.Свойства[0].Тип.Свойства[0].Тип); // ОбъектXDTO
			СсылкаНаОбъект.Установить(Свойство, ЗначениеXDTOЛюбаяСсылка);
			
			ЛюбаяСсылкаОбъект = ФабрикаXDTO.Создать(ТипXDTO.Свойства[0].Тип);
			ЛюбаяСсылкаОбъект.СсылкаНаОбъект = СсылкаНаОбъект;
			
			ДанныеXDTO = ФабрикаXDTO.Создать(ТипXDTO); // ОбъектXDTO
			ДанныеXDTO.СсылкаНаОбъект = ФабрикаXDTO.Создать(ТипXDTO.Свойства[0].Тип);
			ДанныеXDTO.Установить(ТипXDTO.Свойства[0], ЛюбаяСсылкаОбъект);
			ФабрикаXDTO.ЗаписатьXML(КомпонентыОбмена.ФайлОбмена, ДанныеXDTO);
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
